Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG01/include/pio/pic32ck0512sg01100.h
#define PIN_PD02E_EBI_A19                          _UINT32_(98)
#define MUX_PD02E_EBI_A19                          _UINT32_(4) 
#define PINMUX_PD02E_EBI_A19                       ((PIN_PD02E_EBI_A19 << 16) | MUX_PD02E_EBI_A19)
#define PORT_PD02E_EBI_A19                         (_UINT32_(1) << 2)

#define PIN_PA13E_EBI_D0                           _UINT32_(13)
#define MUX_PA13E_EBI_D0                           _UINT32_(4) 
#define PINMUX_PA13E_EBI_D0                        ((PIN_PA13E_EBI_D0 << 16) | MUX_PA13E_EBI_D0)
#define PORT_PA13E_EBI_D0                          (_UINT32_(1) << 13)

#define PIN_PA14E_EBI_D1                           _UINT32_(14)
#define MUX_PA14E_EBI_D1                           _UINT32_(4) 
#define PINMUX_PA14E_EBI_D1                        ((PIN_PA14E_EBI_D1 << 16) | MUX_PA14E_EBI_D1)
#define PORT_PA14E_EBI_D1                          (_UINT32_(1) << 14)

#define PIN_PA15E_EBI_D2                           _UINT32_(15)
#define MUX_PA15E_EBI_D2                           _UINT32_(4) 
#define PINMUX_PA15E_EBI_D2                        ((PIN_PA15E_EBI_D2 << 16) | MUX_PA15E_EBI_D2)
#define PORT_PA15E_EBI_D2                          (_UINT32_(1) << 15)

#define PIN_PA16E_EBI_D3                           _UINT32_(16)
#define MUX_PA16E_EBI_D3                           _UINT32_(4) 
#define PINMUX_PA16E_EBI_D3                        ((PIN_PA16E_EBI_D3 << 16) | MUX_PA16E_EBI_D3)
#define PORT_PA16E_EBI_D3                          (_UINT32_(1) << 16)

#define PIN_PA17E_EBI_D4                           _UINT32_(17)
#define MUX_PA17E_EBI_D4                           _UINT32_(4) 
#define PINMUX_PA17E_EBI_D4                        ((PIN_PA17E_EBI_D4 << 16) | MUX_PA17E_EBI_D4)
#define PORT_PA17E_EBI_D4                          (_UINT32_(1) << 17)

#define PIN_PA04E_EBI_D5                           _UINT32_(4) 
#define MUX_PA04E_EBI_D5                           _UINT32_(4) 
#define PINMUX_PA04E_EBI_D5                        ((PIN_PA04E_EBI_D5 << 16) | MUX_PA04E_EBI_D5)
#define PORT_PA04E_EBI_D5                          (_UINT32_(1) << 4)

#define PIN_PA05E_EBI_D6                           _UINT32_(5) 
#define MUX_PA05E_EBI_D6                           _UINT32_(4) 
#define PINMUX_PA05E_EBI_D6                        ((PIN_PA05E_EBI_D6 << 16) | MUX_PA05E_EBI_D6)
#define PORT_PA05E_EBI_D6                          (_UINT32_(1) << 5)

#define PIN_PA06E_EBI_D7                           _UINT32_(6) 
#define MUX_PA06E_EBI_D7                           _UINT32_(4) 
#define PINMUX_PA06E_EBI_D7                        ((PIN_PA06E_EBI_D7 << 16) | MUX_PA06E_EBI_D7)
#define PORT_PA06E_EBI_D7                          (_UINT32_(1) << 6)

#define PIN_PA07E_EBI_D8                           _UINT32_(7) 
#define MUX_PA07E_EBI_D8                           _UINT32_(4) 
#define PINMUX_PA07E_EBI_D8                        ((PIN_PA07E_EBI_D8 << 16) | MUX_PA07E_EBI_D8)
#define PORT_PA07E_EBI_D8                          (_UINT32_(1) << 7)

#define PIN_PA08E_EBI_D9                           _UINT32_(8) 
#define MUX_PA08E_EBI_D9                           _UINT32_(4) 
#define PINMUX_PA08E_EBI_D9                        ((PIN_PA08E_EBI_D9 << 16) | MUX_PA08E_EBI_D9)
#define PORT_PA08E_EBI_D9                          (_UINT32_(1) << 8)

#define PIN_PB11E_EBI_D10                          _UINT32_(43)
#define MUX_PB11E_EBI_D10                          _UINT32_(4) 
#define PINMUX_PB11E_EBI_D10                       ((PIN_PB11E_EBI_D10 << 16) | MUX_PB11E_EBI_D10)
#define PORT_PB11E_EBI_D10                         (_UINT32_(1) << 11)

#define PIN_PB12E_EBI_D11                          _UINT32_(44)
#define MUX_PB12E_EBI_D11                          _UINT32_(4) 
#define PINMUX_PB12E_EBI_D11                       ((PIN_PB12E_EBI_D11 << 16) | MUX_PB12E_EBI_D11)
#define PORT_PB12E_EBI_D11                         (_UINT32_(1) << 12)

#define PIN_PB05E_EBI_D12                          _UINT32_(37)
#define MUX_PB05E_EBI_D12                          _UINT32_(4) 
#define PINMUX_PB05E_EBI_D12                       ((PIN_PB05E_EBI_D12 << 16) | MUX_PB05E_EBI_D12)
#define PORT_PB05E_EBI_D12                         (_UINT32_(1) << 5)

#define PIN_PB13E_EBI_D13                          _UINT32_(45)
#define MUX_PB13E_EBI_D13                          _UINT32_(4) 
#define PINMUX_PB13E_EBI_D13                       ((PIN_PB13E_EBI_D13 << 16) | MUX_PB13E_EBI_D13)
#define PORT_PB13E_EBI_D13                         (_UINT32_(1) << 13)

#define PIN_PB06E_EBI_D14                          _UINT32_(38)
#define MUX_PB06E_EBI_D14                          _UINT32_(4) 
#define PINMUX_PB06E_EBI_D14                       ((PIN_PB06E_EBI_D14 << 16) | MUX_PB06E_EBI_D14)
#define PORT_PB06E_EBI_D14                         (_UINT32_(1) << 6)

#define PIN_PB14E_EBI_D15                          _UINT32_(46)
#define MUX_PB14E_EBI_D15                          _UINT32_(4) 
#define PINMUX_PB14E_EBI_D15                       ((PIN_PB14E_EBI_D15 << 16) | MUX_PB14E_EBI_D15)
#define PORT_PB14E_EBI_D15                         (_UINT32_(1) << 14)

#define PIN_PB08E_EBI_NBS0_A0                      _UINT32_(40)
#define MUX_PB08E_EBI_NBS0_A0                      _UINT32_(4) 
#define PINMUX_PB08E_EBI_NBS0_A0                   ((PIN_PB08E_EBI_NBS0_A0 << 16) | MUX_PB08E_EBI_NBS0_A0)
#define PORT_PB08E_EBI_NBS0_A0                     (_UINT32_(1) << 8)

#define PIN_PB07E_EBI_NBS1_NWR1                    _UINT32_(39)
#define MUX_PB07E_EBI_NBS1_NWR1                    _UINT32_(4) 
#define PINMUX_PB07E_EBI_NBS1_NWR1                 ((PIN_PB07E_EBI_NBS1_NWR1 << 16) | MUX_PB07E_EBI_NBS1_NWR1)
#define PORT_PB07E_EBI_NBS1_NWR1                   (_UINT32_(1) << 7)

#define PIN_PC20E_EBI_NBS2_NWR2_A1                 _UINT32_(84)
#define MUX_PC20E_EBI_NBS2_NWR2_A1                 _UINT32_(4) 
#define PINMUX_PC20E_EBI_NBS2_NWR2_A1              ((PIN_PC20E_EBI_NBS2_NWR2_A1 << 16) | MUX_PC20E_EBI_NBS2_NWR2_A1)
#define PORT_PC20E_EBI_NBS2_NWR2_A1                (_UINT32_(1) << 20)

#define PIN_PD12E_EBI_NCS0                         _UINT32_(108)
#define MUX_PD12E_EBI_NCS0                         _UINT32_(4) 
#define PINMUX_PD12E_EBI_NCS0                      ((PIN_PD12E_EBI_NCS0 << 16) | MUX_PD12E_EBI_NCS0)
#define PORT_PD12E_EBI_NCS0                        (_UINT32_(1) << 12)

#define PIN_PD09E_EBI_NCS1                         _UINT32_(105)
#define MUX_PD09E_EBI_NCS1                         _UINT32_(4) 
#define PINMUX_PD09E_EBI_NCS1                      ((PIN_PD09E_EBI_NCS1 << 16) | MUX_PD09E_EBI_NCS1)
#define PORT_PD09E_EBI_NCS1                        (_UINT32_(1) << 9)

#define PIN_PB15E_EBI_NRD                          _UINT32_(47)
#define MUX_PB15E_EBI_NRD                          _UINT32_(4) 
#define PINMUX_PB15E_EBI_NRD                       ((PIN_PB15E_EBI_NRD << 16) | MUX_PB15E_EBI_NRD)
#define PORT_PB15E_EBI_NRD                         (_UINT32_(1) << 15)

#define PIN_PA10E_EBI_NWAIT                        _UINT32_(10)
#define MUX_PA10E_EBI_NWAIT                        _UINT32_(4) 
#define PINMUX_PA10E_EBI_NWAIT                     ((PIN_PA10E_EBI_NWAIT << 16) | MUX_PA10E_EBI_NWAIT)
#define PORT_PA10E_EBI_NWAIT                       (_UINT32_(1) << 10)

